In [19]:
%run utils.ipynb

In [20]:
transaction_json_df, transaction_json_df_counts = read_transactions_json(raw_path)

In [21]:
transaction_json_df.head(10)

  location_id        date transaction_id profit
0         001  2019-01-02            001  25.14
1         001  2019-01-02            002  21.69
2         001  2019-01-02            003  24.74
3         001  2019-01-02            004  23.08
4         001  2019-01-02            005  23.24
5         001  2019-01-02            006  22.92
6         001  2019-01-02            007  26.71
7         001  2019-01-02            008  25.79
8         001  2019-01-02            009  22.99
9         001  2019-01-02            010   25.7

In [22]:
# transaction_df1 = pd.read_json('../data/transactions_001_system3.json')
# transaction_df1_count = len(transaction_df1)
# transaction_df1.head(10)

In [23]:
# transaction_df2 = pd.read_json('../data/transactions_002_system3.json')
# transaction_df2_count = len(transaction_df2)
# transaction_df2.head(10)

In [24]:
# transaction_df5 = pd.read_json('../data/transactions_005_system3.json')
# transaction_df5_count = len(transaction_df5)
# transaction_df5.head(10)

In [25]:
# transaction_df10 = pd.read_json('../data/transactions_010_system3.json')
# transaction_df10_count = len(transaction_df10)
# transaction_df10.head(10)

In [26]:
# print(transaction_df1_count, transaction_df2_count, transaction_df5_count, transaction_df10_count)

In [27]:
# transaction_df_system3 = pd.concat([transaction_df1, transaction_df2, transaction_df5, transaction_df10], axis=0)
# transaction_df_system3.head(10)

In [28]:
invalid_location_check(transaction_json_df,'location_id')

Empty DataFrame
Columns: [location_id, date, transaction_id, profit]
Index: []

In [29]:
date_pattern = r'^\d{4}-\d{2}-\d{2}'
invalid_date_check(transaction_json_df,date_pattern)

Empty DataFrame
Columns: [location_id, date, transaction_id, profit]
Index: []

In [30]:
invalid_transaction_id_check(transaction_json_df, 'transaction_id')

Empty DataFrame
Columns: [location_id, date, transaction_id, profit]
Index: []

In [31]:
invalid_profit(transaction_json_df)

      location_id        date transaction_id profit
2973          001  2020-02-07            001    NaN
3031          001  2020-02-14            001    NaN
13356         010  2021-02-02            001    NaN
17364         005  2019-02-26            001    NaN
19290         005  2020-02-17            001    NaN
19370         005  2020-05-28            001    NaN
19389         005  2020-06-01            001    NaN
20818         005  2021-02-03            001    NaN
27848         002  2020-05-29            001    NaN
27849         002  2020-05-30            001    NaN
27996         002  2020-06-15            001    NaN

In [37]:
transaction_json_df.astype(transaction_schema)
transaction_json_df['date'] = pd.to_datetime(transaction_json_df['date'])
transaction_json_df['profit'] = transaction_json_df['profit'].astype(float)
transaction_json_df.head(10)

  location_id       date transaction_id  profit
0         001 2019-01-02            001   25.14
1         001 2019-01-02            002   21.69
2         001 2019-01-02            003   24.74
3         001 2019-01-02            004   23.08
4         001 2019-01-02            005   23.24
5         001 2019-01-02            006   22.92
6         001 2019-01-02            007   26.71
7         001 2019-01-02            008   25.79
8         001 2019-01-02            009   22.99
9         001 2019-01-02            010   25.70

In [38]:
transaction_json_df.dtypes

location_id               object
date              datetime64[ns]
transaction_id            object
profit                   float64
dtype: object

In [39]:
nan_counts = transaction_json_df.isna().sum()
print("NaN counts in each column:")
print(nan_counts)

NaN counts in each column:
location_id        0
date               0
transaction_id     0
profit            11
dtype: int64

In [40]:
len(transaction_json_df)

34674

In [41]:
file_name = 'transaction_data_system_3.csv'
write_to_path_bronze(transaction_json_df,bronze_path,file_name)

DataFrame saved to ../Submission/bronze_data/transaction_data/transaction_data_system_3.csv